Revit 2027 API
ParameterTypeId.ViewSchemaSettingForBuilding Property
 "Color Scheme"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSchemaSettingForBuilding { get; }
Public Shared ReadOnly Property ViewSchemaSettingForBuilding As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSchemaSettingForBuilding {
	ForgeTypeId^ get ();
}
static member ViewSchemaSettingForBuilding : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace